workspace/КомиссионнаяТорговля/src/Documents/РасходнаяНакладная/РасходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходнаяНакладная</name>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиНоменклатуры</registerRecords>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокНоменклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорКомиссии</name>
      <type>
        <types>CatalogRef.Договоры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

workspace/КомиссионнаяТорговля/src/AccumulationRegisters/ОстаткиНоменклатуры/ОстаткиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиНоменклатуры</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

workspace/КомиссионнаяТорговля/src/Documents/РасходнаяНакладная/Forms/ФормаДокумента/Module.bsl
#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассичтатьСумму(ТекущиеДанные)
	
	ТекущиеДанные.Сумма  = ТекущиеДанные.Количество * ТекущиеДанные.Цена;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокНоменклатурыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	РассичтатьСумму(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	РассичтатьСумму(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыСуммаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	ТекущиеДанные.Количество = ТекущиеДанные.Сумма / ТекущиеДанные.Цена;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыДоговорНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	АдресХранилища = СписокНоменклатурыДоговорНачалоВыбораНаСервере(ТекущиеДанные.Номенклатура);
	
	ПараметрыВыбораДоговора = ПолучитьИзВременногоХранилища(АдресХранилища);
	Если ПараметрыВыбораДоговора = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Форма = ПолучитьФорму("Справочник.Договоры.ФормаВыбора");
	
	ЭлементОтбора = Форма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Ссылка");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.Использование  = Истина;
	ЭлементОтбора.ПравоеЗначение = ПараметрыВыбораДоговора.СписокДоговоров;
	
	Форма.Параметры.РежимВыбора = Истина;
	Форма.ВладелецФормы         = Элемент;
	Форма.Открыть();
		
КонецПроцедуры

&НаСервере
Функция СписокНоменклатурыДоговорНачалоВыбораНаСервере(Номенклатура)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='Перед выбором договора нужно записать документ!'");
		Сообщение.Сообщить();
		
		Возврат Неопределено;

	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОстаткиНоменклатурыОстатки.Договор КАК Договор
		|ИЗ
		|	РегистрНакопления.ОстаткиНоменклатуры.Остатки(&Момент, Организация = &Организация
		|	И Номенклатура = &Номенклатура) КАК ОстаткиНоменклатурыОстатки
		|ГДЕ
		|	ОстаткиНоменклатурыОстатки.КоличествоОстаток > 0";
	
	Запрос.УстановитьПараметр("Момент", Объект.Ссылка.МоментВремени());
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	ПараметрыВыбораДоговора = Новый Структура("СписокДоговоров", РезультатЗапроса.ВыгрузитьКолонку("Договор"));
		
	АдресХранилища = ПоместитьВоВременноеХранилище(ПараметрыВыбораДоговора);
	
	Возврат АдресХранилища;
	
КонецФункции



#КонецОбласти
